{"idx": "364", "label": "not_entailment", "sentence1": "Both doctor and patient bear some responsibility for successful care.", "sentence2": "The attorney does not bear responsibility for successful care.", "logic": "Conjunction;Negation"}
{"idx": "208", "label": "entailment", "sentence1": "This means that solving analogy questions with vector arithmetic is mathematically equivalent to seeking a word that is similar to x and y but is different from z.", "sentence2": "This means that seeking a word that is similar to x and y but is different from z is mathematically equivalent to solving analogy questions with vector arithmetic.", "lexical-semantics": "Symmetry/Collectivity", "predicate-argument-structure": "Core args"}
{"idx": "568", "label": "entailment", "sentence1": "From a quick Google search, Bitcoin Cash was created as a hard fork of Bitcoin and it's supposed to be faster and more sustainable.", "sentence2": "From a quick Google search, it was created as a hard fork of Bitcoin and it's supposed to be faster and more sustainable than Bitcoin.", "predicate-argument-structure": "Ellipsis/Implicits;Anaphora/Coreference"}
{"idx": "915", "label": "entailment", "sentence1": "Indeed, it is often stated that for humans to learn how to perform adequately in a domain, one-shot learning is sufficient.", "sentence2": "Indeed, it is often stated that for humans to learn how to perform adequately in a domain, one example is enough from which to learn.", "knowledge": "World knowledge"}
{"idx": "465", "label": "not_entailment", "sentence1": "LaBeouf had tried to bum a smoke from a police officer.", "sentence2": "LaBeouf had tried to bum a smoke from two strangers, unaware that one of them was a police officer.", "lexical-semantics": "Factivity", "predicate-argument-structure": "Anaphora/Coreference"}
{"idx": "71", "label": "not_entailment", "sentence1": "All of the graduates of my program have moved on to other things because the jobs suck.", "sentence2": "Most of the graduates of my program have moved on to other things because the jobs suck.", "lexical-semantics": "Quantifiers"}
{"idx": "876", "label": "entailment", "sentence1": "To compute the perplexity numbers on the test data, our model only takes account of log probabilities on word prediction.", "sentence2": "To compute the perplexity numbers on the test data, our model doesn't take account of anything other than the log probabilities on word prediction.", "logic": "Double negation"}
{"idx": "911", "label": "not_entailment", "sentence1": "The systems thus produced support the capability to interrupt an interlocutor mid-sentence.", "sentence2": "The systems thus produced are incremental: dialogues are processed word-by-word, shown previously to be essential in supporting natural, spontaneous dialogue.", "knowledge": "Common sense"}
{"idx": "816", "label": "entailment", "sentence1": "The pharaohs of the Middle Kingdom restored the country's stability and prosperity, thereby stimulating a resurgence of art, literature, and monumental building projects.", "sentence2": "The pharaohs of the Middle Kingdom of Egypt restored the country's stability and prosperity, thereby stimulating a resurgence of art, literature, and monumental building projects.", "knowledge": "World knowledge"}
{"idx": "841", "label": "entailment", "sentence1": "Due to the structure and short length of most Wikipedia documents (median number of sentences: 9), the answer can always be inferred from the first few sentences.", "sentence2": "Due to the structure and short length of most Wikipedia documents (median number of sentences: 9), the answer can usually be inferred from the first few sentences.", "lexical-semantics": "Quantifiers"}
{"idx": "790", "label": "not_entailment", "sentence1": "Albertosaurus and other tyrannosaurids were heterodont, with teeth of different forms depending on their position in the mouth.", "sentence2": "Albertosaurus and other tyrannosaurids were heterodont, with lots of teeth.", "predicate-argument-structure": "Restrictivity", "knowledge": "World knowledge"}
{"idx": "858", "label": "entailment", "sentence1": "This gives the model a sense of the implied action dynamics of the verb between the agent and the world.", "sentence2": "This gives to the model a sense of the implied action dynamics of the verb between the agent and the world.", "predicate-argument-structure": "Datives"}
{"idx": "193", "label": "not_entailment", "sentence1": "The translations generate models with their constituency tree and their attention-derived alignments.", "sentence2": "The models generate translations with their constituency tree and their attention-derived alignments.", "lexical-semantics": "Symmetry/Collectivity", "predicate-argument-structure": "Core args"}
{"idx": "432", "label": "not_entailment", "sentence1": "The move marks an end to a system put in place by Deng Xiaoping in the 1980s to prevent the rise of another Mao, who was chairman of the Communist Party from before its accession to power in 1949 until his death in 1976.", "sentence2": "Deng Xiaoping was chairman of the Communist Party from before its accession to power in 1949 until his death in 1976.", "predicate-argument-structure": "Relative clauses", "knowledge": "World knowledge"}
{"idx": "148", "label": "entailment", "sentence1": "The man gets down on one knee and inspects the bottom of the elephant's foot only to find a large thorn deeply embedded.", "sentence2": "The man gets down on one knee and inspects the bottom of the foot of the elephant only to find a large thorn deeply embedded.", "predicate-argument-structure": "Genitives/Partitives"}
{"idx": "20", "label": "not_entailment", "sentence1": "And if both apply, they are essentially impossible.", "sentence2": "And if both apply, they are essentially possible.", "lexical-semantics": "Morphological negation", "logic": "Negation;Conditionals"}
{"idx": "558", "label": "entailment", "sentence1": "Our deepest sympathies are with all those affected by this accident.", "sentence2": "Our deepest sympathies are with a victim who was affected by this accident.", "logic": "Universal"}
{"idx": "709", "label": "not_entailment", "sentence1": "A faint constellation, its three brightest stars—Alpha, Beta and Gamma Pyxidis—are in an equilateral triangle.", "sentence2": "A faint constellation, its three brightest stars—Alpha, Beta and Gamma Pyxidis—are in a rough line.", "lexical-semantics": "Lexical entailment", "knowledge": "Common sense"}
{"idx": "295", "label": "not_entailment", "sentence1": "The sides came to an agreement after their meeting in Europe.", "sentence2": "The sides came to an agreement after their meeting in Stockholm.", "lexical-semantics": "Named entities", "knowledge": "World knowledge"}
{"idx": "952", "label": "not_entailment", "sentence1": "A serene wind rolled across the glade.", "sentence2": "A tempestuous wind rolled across the glade.", "lexical-semantics": "Lexical entailment"}
{"idx": "984", "label": "entailment", "sentence1": "The profits of the businesses that focused on branding were still negative.", "sentence2": "The businesses that focused on branding still had negative profits.", "predicate-argument-structure": "Relative clauses"}
{"idx": "1037", "label": "not_entailment", "sentence1": "He was satisfied.", "sentence2": "He earnestly proclaimed: \"This is all I ever really wanted.\"", "knowledge": "Common sense"}
{"idx": "351", "label": "not_entailment", "sentence1": "I did not fail my resolutions in 2004.", "sentence2": "I have failed my resolutions every year since 1997, and it's now 2008.", "logic": "Intervals/Numbers"}
{"idx": "905", "label": "entailment", "sentence1": "Logits are then computed for these actions and particular actions are chosen according to a softmax over these logits during training and decoding.", "sentence2": "A distribution is then computed over these actions using a softmax function and particular actions are chosen accordingly during training and decoding.", "knowledge": "World knowledge"}
{"idx": "739", "label": "not_entailment", "sentence1": "By saying this, Kennedy was admonishing people not to riot in wake of King's death and in effect equating their actions to that of Malcolm X's assassin.", "sentence2": "By saying this, Kennedy was admonishing people not to riot in wake of King's death and in effect equating their actions to that of the civil rights leader's assassin.", "knowledge": "World knowledge"}
{"idx": "307", "label": "entailment", "sentence1": "The Sydney area has been inhabited by Aboriginal people for at least 30,000 years.", "sentence2": "The Sydney area has been inhabited by indigenous Australians for at least 30,000 years.", "lexical-semantics": "Named entities", "knowledge": "World knowledge"}
{"idx": "545", "label": "not_entailment", "sentence1": "Microsoft has said a class action is warranted because there isn't a common cause for the employees’ complaints and plaintiffs have not identified systemic gender discrimination.", "sentence2": "Microsoft has said a class action isn’t warranted because there is no common cause for the employees’ complaints and plaintiffs have not identified systemic gender discrimination.", "logic": "Negation"}
{"idx": "658", "label": "not_entailment", "sentence1": "Just watched the first 15 minutes, got bored, skipped to the magic bit, it's funnier as a GIF.", "sentence2": "Just watched the first 30 minutes, got bored, skipped to the magic bit, it's funnier as a GIF.", "logic": "Intervals/Numbers;Non-monotone", "knowledge": "Common sense"}
{"idx": "534", "label": "entailment", "sentence1": "Russia’s ruling system, while projecting an image of unity, is divided along many lines — between security hawks and economic liberals, between people with personal vendettas, and between competing business interests.", "sentence2": "Russia’s ruling projects an image of unity, but is divided along many lines — between security hawks and economic liberals, between people with personal vendettas, and between competing business interests.", "predicate-argument-structure": "Core args"}
{"idx": "968", "label": "entailment", "sentence1": "She didn't think I had already finished it, but I had.", "sentence2": "I had already finished it.", "predicate-argument-structure": "Ellipsis/Implicits"}
{"idx": "859", "label": "entailment", "sentence1": "This gives to the model a sense of the implied action dynamics of the verb between the agent and the world.", "sentence2": "This gives the model a sense of the implied action dynamics of the verb between the agent and the world.", "predicate-argument-structure": "Datives"}
{"idx": "262", "label": "entailment", "sentence1": "Tanks were developed by Britain and France, and were first used in combat by the British during a battle with German forces.", "sentence2": "Tanks were developed by Britain and France, and were first used in combat by the British during a battle.", "predicate-argument-structure": "Prepositional phrases"}
